; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 
           tile_1-1 tile_1-2 
           tile_2-1 tile_2-2 
           tile_3-1 tile_3-2 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_3-2)
   (robot-has robot1 white)
   (robot-at robot2 tile_0-1)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-2)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_3-1)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (right tile_0-2 tile_0-1)
   (right tile_1-2 tile_1-1)
   (right tile_2-2 tile_2-1)
   (right tile_3-2 tile_3-1)
   (left tile_0-1 tile_0-2)
   (left tile_1-1 tile_1-2)
   (left tile_2-1 tile_2-2)
   (left tile_3-1 tile_3-2)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
))
 (:metric minimize (total-cost))
)

; plan
1. (left robot1 tile_3-2 tile_3-1)
   deleted: (robot-at robot1 tile_3-2) (clear tile_3-1)
   added: (robot-at robot1 tile_3-1) (clear tile_3-2)
   goals met: 0 of 6
2. (down robot1 tile_3-1 tile_2-1)
   deleted: (robot-at robot1 tile_3-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_3-1)
   goals met: 0 of 6
3. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 1 of 6
4. (right robot1 tile_2-1 tile_2-2)
   deleted: (robot-at robot1 tile_2-1) (clear tile_2-2)
   added: (robot-at robot1 tile_2-2) (clear tile_2-1)
   goals met: 1 of 6
5. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 1 of 6
6. (paint-up robot1 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 2 of 6
7. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 2 of 6
8. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 2 of 6
9. (down robot1 tile_2-2 tile_1-2)
   deleted: (robot-at robot1 tile_2-2) (clear tile_1-2)
   added: (robot-at robot1 tile_1-2) (clear tile_2-2)
   goals met: 2 of 6
10. (paint-up robot1 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 3 of 6
11. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 3 of 6
12. (left robot1 tile_1-2 tile_1-1)
   deleted: (robot-at robot1 tile_1-2) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_1-2)
   goals met: 3 of 6
13. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 4 of 6
14. (right robot1 tile_1-1 tile_1-2)
   deleted: (robot-at robot1 tile_1-1) (clear tile_1-2)
   added: (robot-at robot1 tile_1-2) (clear tile_1-1)
   goals met: 4 of 6
15. (down robot1 tile_1-2 tile_0-2)
   deleted: (robot-at robot1 tile_1-2) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_1-2)
   goals met: 4 of 6
16. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 5 of 6
17. (paint-up robot2 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 6 of 6
